#include <iostream>
#include <fstream>

/*Сделать конвертер величин. Формат ввода: Направление_Перевода Величина.Температура (градусы, кельвины, фаренгейты)*/
/*(32 °F − 32) × 5/9 + 273,15 = 273,15 K   (0 K − 273,15) × 9/5 + 32    (0 °C × 9/5) + 32    (32 °F − 32) × 5/9 + 273,15
*/
int main()
{
    setlocale(LC_ALL, "Russian");

    std::ofstream f("Answer.txt");

    int a, b, c;
    float x;
    float P;

    std::cout << "Введите номер числа которое вы хотите переводить, далее номер числа в которое вы хотите перевести "<<std::endl;
    std::cout << "Градусы Цельсия- 1     Кельвины - 2     Фарингейты - 3" << std::endl;
    std::cin >> a >> b ; 
    std::cout << "Введите число" << std::endl;   
    std::cin >>x;  
    if ((a==1) && (b==2)) {
        P = (x - 32) * 5 / 9 + 273.15;
    }
    if ((a == 1) && (b == 3)) {
        P = x * 9 / 5 + 32;
    }
    if ((a == 2) && (b == 1)) {
        P = x-273.15;
    }
    if ((a == 2) && (b == 3)) {
        P = (x - 273.15) * 9 / 5 + 32;
    }
    if ((a == 3) && (b == 1)) {
        P = (x * 9 / 5) + 32;
    }
    if ((a == 3) && (b == 2)) {
        P = (x - 32) * 5 / 9 + 273.15;
    }
    std::cout << P;

    f << P;
    f.close();
}
